---
kind: type
id: T:Autodesk.Revit.DB.AttachmentType
source: html/1656f19c-da78-adae-59f2-e1821b1600ef.htm
---
# Autodesk.Revit.DB.AttachmentType

Enum determining whether a link is an attachment or an overlay

## Syntax (C#)
```csharp
public enum AttachmentType
```